{
    "questions":[
        "What’s the first memory you have of me?",
        "If we could relive one day from our past, what would it be?",
        "What’s the funniest thing we’ve ever done together?",
        "What’s something silly we used to believe as kids?",
        "If we made a “Greatest Hits” album of our friendship, what moments would be on it?",
        "What’s the weirdest inside joke we’ve ever had?",
        "If we were characters in a movie about our lives, who would play us?",
        "What’s something you thought was cool when we first met that’s embarrassing now?",
        "What’s the most random place we’ve ever run into each other?",
        "What’s a habit you picked up from me?",
        "If we could switch lives for a day, what would you do first?",
        "If we were stranded on an island, what three things would you bring?",
        "If we had to start a business together, what would it be?",
        "If you could only eat one food for the rest of your life, what would it be?",
        "If we were in a zombie apocalypse, what would our roles be?",
        "If we could teleport anywhere right now, where would we go?",
        "If we could time travel, would you go to the past or the future?",
        "If we had a theme song, what would it be?",
        "If we were famous, what would we be famous for?",
        "If we could invent a new holiday, what would it celebrate?",
        "What’s something you’ve changed your mind about in the last year?",
        "If you could give your younger self one piece of advice, what would it be?",
        "What’s something you’re secretly really proud of?",
        "What’s a fear you’ve overcome?",
        "What’s something you wish more people understood about you?",
        "What’s the best piece of life advice you’ve ever received?",
        "If you could master one skill instantly, what would it be?",
        "What’s something you’ve learned from me?",
        "What’s a dream you’ve let go of that you still think about?",
        "What’s something small that makes you really happy?",
        "What’s the weirdest food combination you secretly enjoy?",
        "What’s the most ridiculous fact you know?",
        "If you could have any animal as a pet, what would it be?",
        "What’s the most useless talent you have?",
        "If you had to describe yourself as a kitchen appliance, what would you be?",
        "What’s the most embarrassing song on your playlist?",
        "What’s something you pretend to hate but actually love?",
        "If you could only wear one color for the rest of your life, what would it be?",
        "What’s the worst fashion trend you’ve ever participated in?",
        "What’s the funniest text you’ve ever accidentally sent?",
        "If we were in a sitcom, what would our dynamic be?",
        "What’s a movie you love that everyone else hates?",
        "What TV show do you secretly binge-watch?",
        "If you could live in any fictional universe, where would it be?",
        "What’s a song that instantly reminds you of me?",
        "If we could be any two characters from a TV show, who would we be?",
        "What’s the worst movie you’ve ever seen but still love?",
        "If we had a podcast, what would it be about?",
        "What’s a book you pretend to have read but actually haven’t?",
        "What’s the most overrated celebrity in your opinion?",
        "What’s the weirdest thing you’ve ever eaten?",
        "If you could only eat at one restaurant forever, where would it be?",
        "What’s a food you hated as a kid but love now?",
        "What’s your go-to midnight snack?",
        "If you were a flavor of ice cream, what would you be?",
        "What’s a meal you could cook perfectly without a recipe?",
        "What’s the most disappointing food you’ve ever had?",
        "If we opened a food truck together, what would we sell?",
        "What’s a food you love that most people find gross?",
        "What’s the best thing you’ve ever eaten while drunk or high?",
        "What’s the most spontaneous trip you’ve ever taken?",
        "If we could go on a road trip anywhere, where would we go?",
        "What’s the most overrated tourist spot you’ve visited?",
        "What’s the weirdest souvenir you’ve ever bought?",
        "If you could live in any country for a year, where would it be?",
        "What’s the worst travel experience you’ve ever had?",
        "What’s a place you’ve been that exceeded your expectations?",
        "If we could go on an all-expenses-paid vacation right now, where would we go?",
        "What’s a travel destination you never want to visit again?",
        "What’s the most beautiful place you’ve ever seen?",
        "What’s something you’ve always wanted to try but haven’t yet?",
        "What’s a skill you’re currently trying to learn?",
        "What’s something you’re weirdly good at?",
        "If you could take a class in anything, what would it be?",
        "What’s a hobby you abandoned that you miss?",
        "What’s something you’ve done recently that made you proud?",
        "What’s a habit you’re trying to break?",
        "What’s the most unexpected life lesson you’ve learned?",
        "What’s something you want to accomplish in the next year?",
        "What’s a small thing that makes your day better?",
        "What’s the nicest thing someone has ever done for you?",
        "What’s a friendship deal-breaker for you?",
        "What’s the most important quality in a friend?",
        "What’s something you appreciate about our friendship?",
        "What’s a piece of relationship advice you’d give your younger self?",
        "What’s your love language?",
        "What’s the weirdest way you’ve ever made a friend?",
        "What’s a friendship moment that meant a lot to you?",
        "If we had to describe our friendship in three words, what would they be?",
        "What’s something you wish people did more of in friendships?",
        "What’s the worst job you’ve ever had?",
        "If money wasn’t an issue, what job would you do for free?",
        "What’s the weirdest job you’ve ever heard of?",
        "If you could retire tomorrow, what would you do?",
        "What’s the most ridiculous workplace rule you’ve ever had to follow?",
        "If you were the boss for a day, what would you change?",
        "What’s something you’ve learned from a past job that still helps you?",
        "What’s a job you think you’d be terrible at?",
        "If you could have any famous mentor, who would it be?",
        "What’s a career you admire but could never do yourself?",
        "What’s the most embarrassing thing in your search history?",
        "If you had to delete all but one app on your phone, which would you keep?",
        "What’s a social media trend you secretly enjoy?",
        "What’s the weirdest DM you’ve ever received?",
        "If you could invent any piece of technology, what would it be?",
        "What’s the most useless app you have?",
        "What’s something you miss about life before smartphones?",
        "If you had to live without the internet for a month, what would you do?",
        "What’s the funniest autocorrect fail you’ve ever had?",
        "What’s the most overrated piece of tech?",
        "What’s something harmless that scares you?",
        "What’s your most irrational fear?",
        "What’s a common fear you don’t understand?",
        "What’s a small thing people do that drives you crazy?",
        "What’s the weirdest phobia you’ve ever heard of?",
        "What’s something you used to be afraid of but aren’t anymore?",
        "What’s a fear you have that you’ve never admitted to anyone?",
        "What’s a sound that instantly annoys you?",
        "What’s a social norm you think is ridiculous?",
        "What’s something people do that they think is polite but is actually annoying?",
        "What’s the most embarrassing thing that’s ever happened to you in public?",
        "What’s the funniest lie you’ve ever told?",
        "What’s the dumbest way you’ve ever injured yourself?",
        "What’s the weirdest dream you’ve ever had?",
        "What’s the most awkward encounter you’ve ever had with a stranger?",
        "What’s the worst date you’ve ever been on?",
        "What’s something you did as a kid that makes you cringe now?",
        "What’s the most ridiculous rumor you’ve ever heard about yourself?",
        "What’s the funniest thing you’ve ever seen in public?",
        "What’s the worst gift you’ve ever received?",
        "What’s something you want to do before you turn 40?",
        "If you could live in any decade, which would you choose?",
        "What’s a place you’d love to visit but haven’t yet?",
        "What’s something you hope never changes in the future?",
        "What’s a skill you want to master before you die?",
        "What’s something you want to be remembered for?",
        "If you could witness any event in the future, what would it be?",
        "What’s a tradition you want to start?",
        "What’s something you hope exists in the next 50 years?",
        "If you could freeze time for a day, what would you do?",
        "What’s a song you love but would never admit to?",
        "Would you rather have spaghetti for hair or sweat maple syrup?",
        "Would you rather grow a new tooth every time you laugh or sneeze confetti?",
        "Would you rather have fingers as long as your legs or legs as short as your fingers?",
        "Would you rather taste everything like chocolate or smell everything like gasoline?",
        "Would you rather hiccup bubbles or burp glitter?",
        "Would you rather have a tail that can’t hold anything or a trunk that can’t pick anything up?",
        "Would you rather sneeze out a live frog every hour or cough up a goldfish once a day?",
        "Would you rather have a belly button that dispenses ketchup or elbows that shoot out whipped cream?",
        "Would you rather have a third arm that’s useless or a second head that won’t stop arguing with you?",
        "Would you rather shed your skin like a snake once a month or molt feathers like a bird every week?",
        "Would you rather be able to fly but only 2 inches off the ground or teleport but only into public restrooms?",
        "Would you rather read minds but only of squirrels or talk to fish but they’re all sarcastic?",
        "Would you rather be invisible but only when no one’s looking or super strong but only when lifting feathers?",
        "Would you rather have X-ray vision but only see through cardboard or time travel but only to last Tuesday?",
        "Would you rather breathe underwater but only in puddles or walk through walls but get stuck halfway every time?",
        "Would you rather have a personal theme song that plays loudly everywhere you go or a spotlight that follows you in darkness?",
        "Would you rather shrink to the size of a grape but weigh as much as a car or grow to the size of a giraffe but weigh as much as a pillow?",
        "Would you rather control fire but only in your own mouth or control ice but only in your socks?",
        "Would you rather be able to clone yourself but the clones hate you or summon a genie who only grants prank wishes?",
        "Would you rather turn anything you touch into cheese or everything you eat taste like toothpaste?",
        "Would you rather drink a smoothie made from random objects in your room or eat a sandwich assembled by a raccoon?",
        "Would you rather only eat food that’s been licked by a cat or only drink liquids that have had a shoe dipped in them?",
        "Would you rather have your favorite food taste rotten or your least favorite food taste amazing?",
        "Would you rather have all drinks served at boiling temperature or freezing temperature forever?",
        "Would you rather have food always slightly too salty or always slightly undercooked?",
        "Would you rather eat a pizza made of dessert ingredients or a cake made of savory ingredients?",
        "Would you rather have your food always move away when you try to eat it or have your utensils turn to jelly when you grab them?",
        "Would you rather only be able to eat with a fork the size of a shovel or a spoon the size of a thimble?",
        "Would you rather have every meal served on a flaming plate or a plate that’s vibrating violently?",
        "Would you rather eat a burger made of literal dirty socks or a hot dog made of pencil erasers?",
        "Would you rather have a pet elephant the size of a hamster or a hamster the size of an elephant?",
        "Would you rather fight a duck-sized Tyrannosaurus rex or a Tyrannosaurus rex-sized duck?",
        "Would you rather have all birds sound like car alarms or all dogs meow like cats?",
        "Would you rather live in a world where trees walk around slowly or clouds scream when it rains?",
        "Would you rather have to high-five every dog you see or apologize to every plant you pass?",
        "Would you rather be chased by a slow, indestructible snail every day or a fast, harmless lion once a year?",
        "Would you rather have to ride a unicycle everywhere or walk on all fours like a gorilla?",
        "Would you rather have all your clothes made of spiderwebs or all your shoes made of jelly?",
        "Would you rather live in a house made of candy that attracts ants or a house made of soap that’s always slippery?",
        "Would you rather communicate only in whale sounds or only in dolphin clicks?",
        "Would you rather have every door you open lead to the wrong room or every chair you sit on collapse?",
        "Would you rather have your phone battery always at 1% but never die or always at 100% but randomly shuts off?",
        "Would you rather have to wear socks on your hands or gloves on your feet forever?",
        "Would you rather only be able to walk backward or only speak in rhymes?",
        "Would you rather have your shadow move independently and mock you or your reflection always look disappointed?",
        "Would you rather have all your clothes two sizes too big or one size too small forever?",
        "Would you rather sneeze every time you say your own name or hiccup every time someone says your name?",
        "Would you rather have to yell everything you say or whisper everything you say?",
        "Would you rather trip over nothing every third step or bump into invisible walls daily?",
        "Would you rather always have wet socks or a tiny rock in your shoe you can’t remove?",
        "Would you rather live in a world where everyone has a clone that hates them or a world where everyone shares one brain cell?",
        "Would you rather have a dragon that’s terrified of you or a unicorn that’s constantly judging you?",
        "Would you rather be a vampire allergic to blood or a werewolf allergic to fur?",
        "Would you rather live in a haunted house where ghosts rearrange your furniture nightly or a house where objects come to life and gossip about you?",
        "Would you rather travel to space but only eat astronaut ice cream forever or live underwater but only breathe through a bendy straw?",
        "Would you rather have a magic wand that only works on inanimate objects or a spellbook where all the spells are in a language you don’t know?",
        "Would you rather be a mermaid with legs but no gills or a fish with arms but no fins?",
        "Would you rather live in a video game with terrible glitches or a movie with awful plot holes?",
        "Would you rather be friends with a talking potato or enemies with a sentient toaster?",
        "Would you rather have a pet alien that constantly pranks you or a robot servant that mishears every command?",
        "Would you rather relive the same hour forever or skip ahead randomly in time without control?",
        "Would you rather know the exact date of your death but not how or know how you’ll die but not when?",
        "Would you rather wake up with a new random accent every day or speak in reverse every Tuesday?",
        "Would you rather live in a world where gravity switches direction randomly or where colors shift every hour?",
        "Would you rather have everything you draw come to life but poorly or everything you write happen but with typos?",
        "Would you rather be stuck in a time loop of your worst day or live forward but everyone else is in a loop?",
        "Would you rather age backward but keep your memories or stop aging but forget everything every decade?",
        "Would you rather have your dreams come true but in the worst way possible or never dream again?",
        "Would you rather be able to pause time but you age double during pauses or slow time but everything sounds distorted?",
        "Would you rather live in a world where everyone whispers or where everyone shouts?",
        "Would you rather be a billionaire but only in Monopoly money or a millionaire but only in pennies?",
        "Would you rather find a $100 bill every day but it’s always soggy or a $20 bill every week but it’s glued to the ground?",
        "Would you rather have unlimited money but everything you buy is slightly broken or a normal salary but everything you own is gold-plated?",
        "Would you rather get paid $1,000 every time you stub your toe or $10,000 every time you accidentally insult someone?",
        "Would you rather be paid in cheese or in socks for the rest of your life?",
        "Would you rather have a wallet that’s always empty but magically pays for things or a wallet that’s always full but everything costs 10x more?",
        "Would you rather be rich but smell like raw onions or poor but smell like fresh cookies?",
        "Would you rather inherit a castle infested with bats or a yacht haunted by seagulls?",
        "Would you rather win the lottery but have to spend it all in one day or earn minimum wage but never have to pay for anything?",
        "Would you rather have a money tree that grows $1 bills or a fountain that spits out diamonds but only at 3 AM?",
        "Would you rather marry a sentient slice of bread or a sentient light bulb?",
        "Would you rather have a partner who only communicates in interpretive dance or in puns?",
        "Would you rather go on a date with a ghost who’s bad at being dead or a robot who’s bad at being a robot?",
        "Would you rather have a love letter delivered by a screaming goat or a singing moose?",
        "Would you rather have everyone you meet instantly adore you but also mimic your every move or have everyone instantly dislike you but leave you alone?",
        "Would you rather have a romantic partner who’s perfect but invisible or visible but constantly embarrassing?",
        "Would you rather be proposed to by a skywriter or by a parade of clowns?",
        "Would you rather have a partner who’s always 10 minutes late or always 2 hours early?",
        "Would you rather have a relationship counselor who’s a mime or a ventriloquist dummy?",
        "Would you rather break up via carrier pigeon or message in a bottle?",
        "Would you rather know all the answers but never be believed or be believed but never know the answers?",
        "Hey, just wanted to see how you're doing!",  
        "How’s life treating you lately?",  
        "Everything good on your end?",  
        "What’s new with you?",  
        "Been thinking about you—how are you holding up?",  
        "Just checking in—hope you're doing alright!",  
        "No pressure to reply, but wanted to say hi!",  
        "How’s your week been so far?",  
        "What’s been on your mind lately?",  
        "Feels like it's been a while—how’ve you been?",  
        "Still alive and kicking?",  
        "What’s the latest adventure in your world?",  
        "Tell me something good (or bad—I’m listening)!"  
    ]
}